app/controllers/backoffice/admins_controller.rb

  def update
    if @admin.update(params_admin)
---
UPDATE "admins" SET "role" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["role", 0], ["encrypted_password", "$2a$11$43S7.mHQD0D4kgOelU.tFus0E6KaUUjDrzVRK5HCM3shoJoITwsL6"], ["updated_at", "2017-08-03 01:04:31.065637"], ["id", 5]]

  def set_admin
    @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? ORDER BY "admins"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]