app/controllers/backoffice/categories_controller.rb

  def create
    @category = CategoryService.create(params_category)
---
INSERT INTO "categories" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Games"], ["created_at", "2017-07-20 01:46:12.154771"], ["updated_at", "2017-07-20 01:46:12.154771"]]

  def set_category
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]