app/controllers/site/home_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."description" ASC
---
  def index
    @categories = Category.order_by_description