app/views/site/profile/ads/edit.html.erb

SELECT "categories".* FROM "categories"
---
        <%= f.label :category %>
        <%= f.collection_select :category_id, Category.all, :id,
         :description, {}, { class: 'form-control' } %>